library-service-acceptance-tests/examples/example-grpc/src/test/resources/acceptance-tests-fixtures.yml

tests:
  - name: GrpcExampleAcceptanceTestWithDeclarativeFixture
    fixtures:
      - request:
          protocol: grpc
          type: com.example.GetCapturedCreditAmountForGptRequest
          predicate: "#request.gatewayPaymentTransactionId == '123'"
          response:
            body:
              amountMoney:
                amount: 10.01
                currency: "USD"
      - request:
          protocol: grpc
          type: com.example.GetCapturedCreditAmountForGptRequest
          predicate: "#request.gatewayPaymentTransactionId == '456'"
          response:
            body:
              amountMoney:
                amount: 99.99
                currency: "USD"
  - name: "*"
    fixtures:
      - request:
          protocol: grpc
          type: com.example.GetInfoRequest
          predicate: "#request.refundRef == '666'"
          response:
            body:
              newRefundId: 789
              legacyRefundRequestId: 1000
